Revit 2024 API
BuiltInFailures.OpeningFailures.OpeningRectDoesnotCutHost Property
 Rectangular opening doesn't cut its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OpeningRectDoesnotCutHost { get; }
Visual Basic
Public Shared ReadOnly Property OpeningRectDoesnotCutHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OpeningRectDoesnotCutHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace